{"target_method": "getElementsMatchingOwnText", "signature": "Elements getElementsMatchingOwnText(Pattern)", "direct_enhancements": [{"method_name": "getElementsContainingOwnText(String)", "relation_type": "Behavioral Similarity", "confidence": 0.9, "reason": "Both methods search for elements containing specific text, but one uses a regular expression and the other uses a literal string.", "is_external": false}, {"method_name": "getElementsMatchingText(Pattern)", "relation_type": "Structural Similarity", "confidence": 0.85, "reason": "Both methods use regular expressions to match text within elements, but one focuses on the element's own text while the other includes descendant text.", "is_external": false}, {"method_name": "getElementsMatchingText(String)", "relation_type": "Substitutability", "confidence": 0.75, "reason": "Both methods match elements based on text patterns, but one uses a compiled regular expression and the other compiles a regular expression from a string.", "is_external": false}, {"method_name": "getElementsContainingText(String)", "relation_type": "Behavioral Similarity", "confidence": 0.8, "reason": "Both methods search for elements containing specific text, but one includes descendant text while the other focuses only on the element's own text.", "is_external": false}, {"method_name": "select(String)", "relation_type": "Dependency", "confidence": 0.7, "reason": "The select method uses CSS selectors to find elements, which can be used to achieve similar results as text-based searches but with different syntax.", "is_external": false}, {"method_name": "select(Evaluator)", "relation_type": "Dependency", "confidence": 0.75, "reason": "The select method with an Evaluator can be used to create custom search criteria, which can be similar to text-based searches but more flexible.", "is_external": false}, {"method_name": "selectFirst(String)", "relation_type": "Dependency", "confidence": 0.65, "reason": "The selectFirst method can be used to find the first element matching a CSS selector, which can be related to finding elements by text but with different criteria.", "is_external": false}, {"method_name": "selectFirst(Evaluator)", "relation_type": "Dependency", "confidence": 0.7, "reason": "The selectFirst method with an Evaluator can be used to find the first element matching custom criteria, which can be related to text-based searches.", "is_external": false}, {"method_name": "expectFirst(String)", "relation_type": "Dependency", "confidence": 0.6, "reason": "The expectFirst method is similar to selectFirst but throws an exception if no match is found, which can be related to finding elements by text.", "is_external": false}, {"method_name": "closest(String)", "relation_type": "Dependency", "confidence": 0.55, "reason": "The closest method finds the closest ancestor matching a CSS selector, which can be related to finding elements by text but with different criteria.", "is_external": false}, {"method_name": "closest(Evaluator)", "relation_type": "Dependency", "confidence": 0.6, "reason": "The closest method with an Evaluator can be used to find the closest ancestor matching custom criteria, which can be related to text-based searches.", "is_external": false}, {"method_name": "selectXpath(String)", "relation_type": "Dependency", "confidence": 0.5, "reason": "The selectXpath method uses XPath expressions to find elements, which can be used to achieve similar results as text-based searches but with different syntax.", "is_external": false}, {"method_name": "selectXpath(String, Class)", "relation_type": "Dependency", "confidence": 0.55, "reason": "The selectXpath method with a node type can be used to find specific types of nodes matching an XPath expression, which can be related to text-based searches.", "is_external": false}]}