{"target_method": "getElementsByAttributeValueMatching", "signature": "Elements getElementsByAttributeValueMatching(String, Pattern)", "direct_enhancements": [{"method_name": "getElementsByAttributeValue(String, String)", "relation_type": "Behavioral Similarity", "confidence": 0.95, "reason": "Both methods search for elements with specific attribute values, but getElementsByAttributeValueMatching uses a regular expression for more flexible matching.", "is_external": false}, {"method_name": "getElementsByAttributeValueNot(String, String)", "relation_type": "Behavioral Similarity", "confidence": 0.9, "reason": "Both methods involve attribute value checks, but getElementsByAttributeValueNot excludes elements with the specified attribute value.", "is_external": false}, {"method_name": "getElementsByAttributeValueContaining(String, String)", "relation_type": "Behavioral Similarity", "confidence": 0.85, "reason": "Both methods search for elements with attribute values that match a certain pattern, but getElementsByAttributeValueContaining uses substring matching.", "is_external": false}, {"method_name": "getElementsByAttributeValueStarting(String, String)", "relation_type": "Behavioral Similarity", "confidence": 0.85, "reason": "Both methods search for elements with attribute values that match a certain pattern, but getElementsByAttributeValueStarting checks for values starting with a specific substring.", "is_external": false}, {"method_name": "getElementsByAttributeValueEnding(String, String)", "relation_type": "Behavioral Similarity", "confidence": 0.85, "reason": "Both methods search for elements with attribute values that match a certain pattern, but getElementsByAttributeValueEnding checks for values ending with a specific substring.", "is_external": false}, {"method_name": "select(String)", "relation_type": "Substitutability", "confidence": 0.8, "reason": "The select method can be used to achieve similar results by using CSS selectors that include attribute value matching patterns.", "is_external": false}, {"method_name": "select(Evaluator)", "relation_type": "Substitutability", "confidence": 0.8, "reason": "The select method with an Evaluator can be used to achieve similar results by customizing the evaluation logic to match attribute values using regular expressions.", "is_external": false}, {"method_name": "selectFirst(String)", "relation_type": "Substitutability", "confidence": 0.75, "reason": "The selectFirst method can be used to find the first element matching a CSS selector that includes attribute value matching patterns.", "is_external": false}, {"method_name": "selectFirst(Evaluator)", "relation_type": "Substitutability", "confidence": 0.75, "reason": "The selectFirst method with an Evaluator can be used to find the first element matching a custom evaluation logic that includes attribute value matching using regular expressions.", "is_external": false}, {"method_name": "expectFirst(String)", "relation_type": "Substitutability", "confidence": 0.75, "reason": "The expectFirst method can be used to find the first element matching a CSS selector that includes attribute value matching patterns, throwing an exception if no match is found.", "is_external": false}, {"method_name": "closest(String)", "relation_type": "Substitutability", "confidence": 0.7, "reason": "The closest method can be used to find the closest ancestor element matching a CSS selector that includes attribute value matching patterns.", "is_external": false}, {"method_name": "closest(Evaluator)", "relation_type": "Substitutability", "confidence": 0.7, "reason": "The closest method with an Evaluator can be used to find the closest ancestor element matching a custom evaluation logic that includes attribute value matching using regular expressions.", "is_external": false}, {"method_name": "is(String)", "relation_type": "Substitutability", "confidence": 0.7, "reason": "The is method can be used to check if the current element matches a CSS selector that includes attribute value matching patterns.", "is_external": false}, {"method_name": "is(Evaluator)", "relation_type": "Substitutability", "confidence": 0.7, "reason": "The is method with an Evaluator can be used to check if the current element matches a custom evaluation logic that includes attribute value matching using regular expressions.", "is_external": false}]}