{"class_uri": "src/main/java/io/cucumber/cucumberexpressions/KeyboardFriendlyDecimalFormatSymbols.java.KeyboardFriendlyDecimalFormatSymbols", "class_docstring": "\nA set of localized decimal symbols that can be written on a regular keyboard.\n<p>\nNote quite complete, feel free to make a suggestion.\n", "superclasses": "", "super_interfaces": [], "methods": [{"method_name": "getInstance", "description": "Returns a customized instance of DecimalFormatSymbols for the specified locale, adjusting the minus sign and grouping separator to be more keyboard-friendly.", "expected_testcases": [{"testcase_name": "LocaleWithMinusSignAndPeriodDecimalSeparator", "description": "Test with a locale that uses the minus sign (U+2212) and period as the decimal separator. Expect the minus sign to be replaced with a hyphen and the grouping separator to be set to a comma."}, {"testcase_name": "LocaleWithMinusSignAndCommaDecimalSeparator", "description": "Test with a locale that uses the minus sign (U+2212) and comma as the decimal separator. Expect the minus sign to be replaced with a hyphen and the grouping separator to be set to a period."}, {"testcase_name": "LocaleWithHyphenAndPeriodDecimalSeparator", "description": "Test with a locale that uses a hyphen as the minus sign and period as the decimal separator. Expect no change to the minus sign and the grouping separator to be set to a comma."}, {"testcase_name": "LocaleWithHyphenAndCommaDecimalSeparator", "description": "Test with a locale that uses a hyphen as the minus sign and comma as the decimal separator. Expect no change to the minus sign and the grouping separator to be set to a period."}, {"testcase_name": "LocaleWithNonStandardMinusSign", "description": "Test with a locale that uses a non-standard character as the minus sign and period as the decimal separator. Expect no change to the minus sign and the grouping separator to be set to a comma."}, {"testcase_name": "LocaleWithNonStandardDecimalSeparator", "description": "Test with a locale that uses a non-standard character as the decimal separator and a hyphen as the minus sign. Expect no change to the minus sign and the grouping separator to remain unchanged."}]}], "overrides": null, "class_name": "KeyboardFriendlyDecimalFormatSymbols", "description": "Class that provides a customized instance of DecimalFormatSymbols, making it more friendly for keyboard input by adjusting the minus sign and grouping separator based on the locale."}