{"class_uri": "src/main/java/io/cucumber/cucumberexpressions/GroupBuilder.java.GroupBuilder", "class_docstring": "", "superclasses": "", "super_interfaces": [], "methods": [{"method_name": "GroupBuilder", "description": "Constructor that initializes the start index of the group.", "expected_testcases": [{"testcase_name": "InitializeWithValidIndex", "description": "Create a new GroupBuilder with a valid positive integer start index, expecting the startIndex field to be set correctly."}, {"testcase_name": "InitializeWithZeroIndex", "description": "Create a new GroupBuilder with a start index of zero, expecting the startIndex field to be set to zero."}]}, {"method_name": "add", "description": "Adds a GroupBuilder to the list of child group builders.", "expected_testcases": [{"testcase_name": "AddSingleGroupBuilder", "description": "Add a single GroupBuilder to an empty list, expecting the list to contain one element."}, {"testcase_name": "AddMultipleGroupBuilders", "description": "Add multiple GroupBuilders to the list, expecting the list to contain all added elements in the correct order."}]}, {"method_name": "build", "description": "Builds a Group using the Matcher and group indices, including all child groups.", "expected_testcases": [{"testcase_name": "BuildWithNoChildren", "description": "Build a Group with no child GroupBuilders, expecting a Group with an empty children list."}, {"testcase_name": "BuildWithChildren", "description": "Build a Group with multiple child GroupBuilders, expecting a Group with a populated children list."}, {"testcase_name": "BuildWithInvalidGroupIndex", "description": "Attempt to build a Group with an invalid group index, expecting an exception or error result."}]}, {"method_name": "setNonCapturing", "description": "Sets the capturing flag to false, indicating the group is non-capturing.", "expected_testcases": [{"testcase_name": "SetNonCapturing", "description": "Set the capturing flag to false, expecting the capturing field to be false."}]}, {"method_name": "isCapturing", "description": "Checks if the group is capturing.", "expected_testcases": [{"testcase_name": "IsCapturingTrue", "description": "Check the capturing flag when it is true, expecting the method to return true."}, {"testcase_name": "IsCapturingFalse", "description": "Check the capturing flag when it is false, expecting the method to return false."}]}, {"method_name": "moveChildrenTo", "description": "Moves all child GroupBuilders to another GroupBuilder.", "expected_testcases": [{"testcase_name": "MoveChildrenToEmptyGroupBuilder", "description": "Move children to an empty GroupBuilder, expecting the target GroupBuilder to contain all children."}, {"testcase_name": "MoveChildrenToNonEmptyGroupBuilder", "description": "Move children to a GroupBuilder that already has children, expecting the target GroupBuilder to contain all children from both sources."}]}, {"method_name": "getChildren", "description": "Returns the list of child GroupBuilders.", "expected_testcases": [{"testcase_name": "GetEmptyChildrenList", "description": "Get the children list when no children have been added, expecting an empty list."}, {"testcase_name": "GetPopulatedChildrenList", "description": "Get the children list after adding multiple children, expecting a list with the added children."}]}, {"method_name": "getSource", "description": "Returns the source string of the group.", "expected_testcases": [{"testcase_name": "GetSourceWithNoSourceSet", "description": "Get the source when no source has been set, expecting a null or default value."}, {"testcase_name": "GetSourceWithSourceSet", "description": "Get the source after setting a valid string, expecting the method to return the set string."}]}, {"method_name": "setSource", "description": "Sets the source string of the group.", "expected_testcases": [{"testcase_name": "SetValidSource", "description": "Set a valid non-empty string as the source, expecting the source field to be updated."}, {"testcase_name": "SetEmptySource", "description": "Set an empty string as the source, expecting the source field to be updated to an empty string."}]}, {"method_name": "getStartIndex", "description": "Returns the start index of the group.", "expected_testcases": [{"testcase_name": "GetStartIndex", "description": "Get the start index after initialization, expecting the method to return the initialized value."}]}, {"method_name": "getEndIndex", "description": "Returns the end index of the group.", "expected_testcases": [{"testcase_name": "GetEndIndexWithNoEndIndexSet", "description": "Get the end index when no end index has been set, expecting a default or initial value."}, {"testcase_name": "GetEndIndexWithEndIndexSet", "description": "Get the end index after setting a valid end index, expecting the method to return the set value."}]}, {"method_name": "setEndIndex", "description": "Sets the end index of the group.", "expected_testcases": [{"testcase_name": "SetValidEndIndex", "description": "Set a valid positive integer as the end index, expecting the endIndex field to be updated."}, {"testcase_name": "SetZeroEndIndex", "description": "Set zero as the end index, expecting the endIndex field to be updated to zero."}]}], "overrides": null, "class_name": "GroupBuilder", "description": "Class responsible for building groups of elements, managing their indices, and handling capturing and non-capturing groups."}