{"class_uri": "src/main/java/io/cucumber/cucumberexpressions/RegexpUtils.java.RegexpUtils", "class_docstring": "", "superclasses": "", "super_interfaces": [], "methods": [{"method_name": "escapeRegex", "description": "Escapes the specified regular expression characters from the input text to prevent them from being interpreted as special characters in a regular expression context.", "expected_testcases": [{"testcase_name": "NoSpecialCharacters", "description": "Input text contains no special characters that need escaping. Expect the output to be identical to the input."}, {"testcase_name": "SingleSpecialCharacter", "description": "Input text contains a single special character that needs escaping. Expect the output to have that character escaped with a backslash."}, {"testcase_name": "MultipleSpecialCharacters", "description": "Input text contains multiple special characters that need escaping. Expect the output to have all those characters escaped with backslashes."}, {"testcase_name": "AllSpecialCharacters", "description": "Input text contains all special characters that need escaping. Expect the output to have all characters escaped with backslashes."}, {"testcase_name": "EmptyString", "description": "Input text is an empty string. Expect the output to be an empty string as well."}, {"testcase_name": "SpecialCharacterAtStart", "description": "Input text starts with a special character that needs escaping. Expect the output to have that character escaped with a backslash at the start."}, {"testcase_name": "SpecialCharacterAtEnd", "description": "Input text ends with a special character that needs escaping. Expect the output to have that character escaped with a backslash at the end."}, {"testcase_name": "SpecialCharacterInMiddle", "description": "Input text has a special character that needs escaping in the middle. Expect the output to have that character escaped with a backslash in the middle."}, {"testcase_name": "ConsecutiveSpecialCharacters", "description": "Input text contains consecutive special characters that need escaping. Expect the output to have all consecutive characters escaped with backslashes."}, {"testcase_name": "MixedCharacters", "description": "Input text contains a mix of special characters that need escaping and regular characters. Expect the output to have only the special characters escaped with backslashes."}]}], "overrides": null, "class_name": "RegexpUtils", "description": "Utility class for escaping regular expression characters in a given text to ensure they are not interpreted as special characters in a regular expression context."}