{"class_uri": "src/main/java/io/cucumber/cucumberexpressions/Argument.java.Argument", "class_docstring": "", "superclasses": "", "super_interfaces": [], "methods": [{"method_name": "build", "description": "A static method that constructs a list of Argument objects from a given group and list of parameter types. It ensures that the number of groups matches the number of parameter types, otherwise it throws an IllegalArgumentException.", "expected_testcases": [{"testcase_name": "MatchingGroupsAndParameterTypes", "description": "Test with a group having the same number of children as the number of parameter types. Expect a list of Argument objects to be returned."}, {"testcase_name": "MismatchedGroupsAndParameterTypes", "description": "Test with a group having a different number of children than the number of parameter types. Expect an IllegalArgumentException to be thrown."}, {"testcase_name": "EmptyGroupsAndParameterTypes", "description": "Test with both the group and parameter types list being empty. Expect an empty list of Argument objects to be returned."}]}, {"method_name": "getGroup", "description": "Returns the group associated with the argument.", "expected_testcases": [{"testcase_name": "GetGroup", "description": "Test retrieving the group from an Argument object. Expect the group used during construction to be returned."}]}, {"method_name": "getValue", "description": "Returns the value of the argument by transforming the group's values using the parameter type's transform method.", "expected_testcases": [{"testcase_name": "GetValue", "description": "Test retrieving the value from an Argument object. Expect the transformed value of the group's values to be returned."}, {"testcase_name": "EmptyGroupValues", "description": "Test retrieving the value when the group's values are empty. Expect an appropriate transformed value based on the parameter type's behavior with empty input."}]}, {"method_name": "getType", "description": "Returns the type of the parameter type associated with the argument.", "expected_testcases": [{"testcase_name": "GetType", "description": "Test retrieving the type from an Argument object. Expect the type of the parameter type used during construction to be returned."}]}, {"method_name": "getParameterType", "description": "Returns the parameter type associated with the argument.", "expected_testcases": [{"testcase_name": "GetParameterType", "description": "Test retrieving the parameter type from an Argument object. Expect the parameter type used during construction to be returned."}]}], "overrides": null, "class_name": "Argument", "description": "A class that represents an argument with a specific parameter type and group. It provides methods to retrieve the group, value, type, and parameter type of the argument."}